Тестовая_база_ERP_14/src/Catalogs/CRM_КатегорииРешений/CRM_КатегорииРешений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_КатегорииРешений</name>
  <comment>Категории решений базы знаний</comment>
  <predefined>
    <items>
      <name>ТекущиеПроблемы</name>
      <description>Выявленные текущие проблемы</description>
    </items>
    <items>
      <name>ДополнительнаяИнформация</name>
      <description>Дополнительная информация</description>
    </items>
    <items>
      <name>РекомендуемаяИнформация</name>
      <description>Рекомендуемая информация</description>
    </items>
  </predefined>
  <attributes>
    <name>ЦветПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветКрасный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗеленый</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветСиний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/CRM_КатегорииРешений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Процедура выполняет заполнение реквизитов предопределенных элементов.
//
Процедура ЗаполнитьПредопределенныеКатегорииРешений() Экспорт

СправочникОбъект = Справочники.CRM_КатегорииРешений.ТекущиеПроблемы.ПолучитьОбъект();
СправочникОбъект.ЦветИндекс			= 15;
СправочникОбъект.ЦветПредставление 	= НСтр("ru='Темно-красный';en='The dark red'");
СправочникОбъект.ЦветКрасный  		= 214;	
СправочникОбъект.ЦветЗеленый  		= 36; 
СправочникОбъект.ЦветСиний  		= 48;
СправочникОбъект.Записать();

СправочникОбъект = Справочники.CRM_КатегорииРешений.ДополнительнаяИнформация.ПолучитьОбъект();
СправочникОбъект.ЦветИндекс			= 22;
СправочникОбъект.ЦветПредставление 	= НСтр("ru='Темно-синий';en='The dark blue'");
СправочникОбъект.ЦветКрасный  		= 52;	
СправочникОбъект.ЦветЗеленый  		= 103; 
СправочникОбъект.ЦветСиний  		= 184;
СправочникОбъект.Записать();

СправочникОбъект = Справочники.CRM_КатегорииРешений.РекомендуемаяИнформация.ПолучитьОбъект();
СправочникОбъект.ЦветИндекс			= 19;
СправочникОбъект.ЦветПредставление 	= НСтр("ru='Темно-зеленый';en='The dark green'");
СправочникОбъект.ЦветКрасный  		= 68;	
СправочникОбъект.ЦветЗеленый  		= 166; 
СправочникОбъект.ЦветСиний  		= 57;
СправочникОбъект.Записать();

КонецПроцедуры	// ЗаполнитьПредопределенныеКатегорииРешений()

#КонецОбласти

#КонецЕсли
